#+TITLE: Modernes C++\linebreak \small...für Programmierer \hfill Unit 09: Klassen 2
#+AUTHOR: Dr. Günter Kolousek
#+OPTIONS: H:1 toc:nil
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation]
#+BEAMER_THEME: Execushares
#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt)

#+LATEX_HEADER:\usepackage{pgfpages}
# +LATEX_HEADER:\pgfpagesuselayout{2 on 1}[a4paper,border shrink=5mm]
# +LATEX: \mode<handout>{\setbeamercolor{background canvas}{bg=black!5}}
#+LATEX_HEADER:\usepackage{xspace}
#+LATEX_HEADER:\usepackage{wasysym}
#+LATEX: \newcommand{\cpp}{C++\xspace}
#+LATEX: \newcommand{\cppXI}{C++11\xspace}
#+LATEX: \newcommand{\cppXIV}{C++14\xspace}
#+LATEX: \newcommand{\cppXVII}{C++17\xspace}

* Vererbung -- 6
\vspace{1.5em}
\small
#+header: :exports  both :results output :tangle src/inheritance5.cpp :flags -std=c++17
#+begin_src C++
#include <iostream>  // inheritance5.cpp
using namespace std;
struct Number {
    virtual void print_num(double d) {
        cout << "is double: " << d << endl; }
    virtual void print_num(int i) {
        cout << "is int: " << i << endl; }
};
struct SpecialNumber : public Number {
    void print_num(int i) {
        cout << "is special int: " << i << endl; }
};
int main() {
    SpecialNumber num;
    num.print_num(3.5);
}
#+end_src

#+RESULTS:
: is special int: 3
\pause
\vspace{-0.9em}
\to überschreiben... verschiedene Scopes! \pause\hspace{0.5em} =virtual= dbzgl. nutzlos

* Vererbung -- 9
\vspace{1.8em}
\footnotesize
#+header: :exports  both :results output :tangle src/inheritance6.cpp :flags -std=c++17
#+begin_src C++
#include <iostream>  // inheritance6.cpp
using namespace std;
struct A { int a;
    virtual void print(string msg) { cout << msg << ' '; }};
struct B : public A { int b; };
struct C : public A { int c; };
struct D : public B, public C {};  // -> dreaded diamond
int main() {
    D d;
    // d.print("Hi");  // error: mehrdeutig!
    d.B::print("Hi");
    // cout << d.a << endl;  // error: mehrdeutig!
    d.B::a = 1;    d.C::a = 2;
    cout << d.B::a << ' ' << d.C::a << endl;
    D* pd{new D};
    // cout << pd << ", " << static_cast<A*>(pd) << endl;
    //   error: mehrdeutig
}
#+end_src

#+RESULTS:
: Hi 1 2

* Vererbung -- 10
\vspace{1.8em}
\footnotesize
#+header: :exports  both :results output :tangle src/inheritance7.cpp :flags -std=c++17
#+begin_src C++
#include <iostream>  // inheritance7.cpp
using namespace std;
struct A { int a;
    virtual void print(string msg) { cout << msg << ' '; }};
struct B : public virtual A { int b; };
struct C : public virtual A { int c; };
struct D : public B, public C {};
int main() {
    D d;  d.print("Hi");  d.B::print("Hi");
    cout << d.a << endl;
    d.B::a = 1;    d.C::a = 2;
    cout << d.B::a << ' ' << d.C::a << endl;
    D* pd{new D};
    A* pa{static_cast<A*>(pd)};
    cout << pd << ", " << pa << ", " << (pd == pa) << endl;
}
#+end_src

#+RESULTS:
: Hi Hi -2010085886
: 2 2
: 0x56528a2dde80, 0x56528a2ddea0, 1
\pause
\vspace{-1em}
\to Compiler macht uns Glauben, dass gleich!!!

* Vererbung -- 12
\vspace{1.7em}
\footnotesize
#+header: :exports  both :results output :tangle src/inheritance8.cpp :flags -std=c++17
#+begin_src C++
#include <iostream>  // inheritance8.cpp
using namespace std;
struct A {
    virtual void foo()=0;
    virtual void bar()=0;
};
struct B : public virtual A {
    void foo() { bar(); }};
struct C : public virtual A {
    void bar() { cout << "bar" << endl; }};
struct D : public B, public C {};
int main() {
    D d;  B& b{d};  C& c{d};
    d.foo();  b.foo();  c.foo();
}
#+end_src

#+RESULTS:
: bar
: bar
: bar
\pause
\vspace{-0.7em}
\to cross delegation...


* Vererbung -- 13
\vspace{1.5em}
\footnotesize
#+header: :exports  both :results output :tangle src/inheritance9.cpp :flags -std=c++17
#+begin_src C++
#include <iostream>  // inheritance9.cpp
using namespace std;
struct A {
    int a;
    A() : a{42} {}
    A(int a) : a{a} {} };
struct B : public virtual A {
    int b;
    B() : A{0}, b{1} {} };
struct C : public B {
    int c;
    C() : c{2} {} };
int main() {
    C c;
    cout << c.a << ' ' << c.b << ' ' << c.c << endl;
}
#+end_src

#+RESULTS:
: 42 1 2

\pause
\vspace{-1em}
(Default)Konstruktor von =A= wird aufgerufen beim Instanzieren von
=c=\pause\newline
\to daher selber aufrufen!

* Vererbung -- 14
\vspace{2.3em}
\footnotesize
#+header: :exports  both :results output :tangle src/inheritance9.cpp :flags -std=c++17
#+begin_src C++
#include <iostream>  // inheritance9.cpp
using namespace std;
struct A {
    int a;
    A() : a{42} {}
    A(int a) : a{a} {} };
struct B : public virtual A {
    int b;
    B() : /* A{0}, */ b{1} {} };  // may stay...
struct C : public B {
    int c;
    C() : A{0}, c{2} {} };
int main() {
    C c;
    cout << c.a << ' ' << c.b << ' ' << c.c << endl;
}
#+end_src

#+RESULTS:
: 0 1 2

* Destruktor -- 2
\vspace{1.5em}
\small
#+header: :exports both :results output :tangle src/destructor2.cpp :flags -std=c++17
#+begin_src C++
#include <iostream>  // destructor2.cpp
using namespace std;
struct Resource {
    ~Resource() {
        cout << "dtor of Resource" << endl;
    }
};
struct Person {
    virtual ~Person()=default;
};
struct Teacher : public Person {
    Resource r;
};
int main() {
    Person* tp{new Teacher{}};
    delete tp;
}
#+end_src

#+RESULTS:
: dtor of Resource

* Destruktor -- 4
\vspace{1em}
\small
#+header: :exports both :results output :tangle src/destructor4.cpp :flags -std=c++17
#+begin_src C++
#include <iostream>  // destructor4.cpp
using namespace std;
struct Person {
    ~Person() noexcept(false) { throw "error"; }
};
int main() {
    try {
        Person p;
    } catch (...) {
        cout << "caught" << endl;
    }
    cout << "the end" << endl;
}
#+end_src

#+RESULTS:
: caught
: the end

* abstrakte Klassen und Methoden
\vspace{1.5em}
\footnotesize
#+header: :exports both :results output :tangle src/abstract.cpp :flags -std=c++17
#+begin_src C++
#include <iostream>  // abstract.cpp
using namespace std;

class Shape {  // abstract class!
  public:
    virtual string print()=0;  // pure virtual (abstract)!
    virtual ~Shape()=default;
};
class Circle : public Shape {
  public:
    string print() override {
        return "I am a circle";
    }
};
int main() {
    Shape* ptr{new Circle};
    cout << ptr->print() << endl;
}
#+end_src

#+RESULTS:
: I am a circle

